basic/controllers/RegistrationCitizenController.php

        if ($citizenInputToValidate->validate()) {

            // ищем, есть ли нужный нам email
            $emailCheck = EmailDB::find()
                ->where(['email' => $citizenInputToValidate->email])
                ->all();
---
SELECT * FROM `email` WHERE `email`='1111123@mail.ru'


                // отправляем письмо с hash для регистрации

                $newCitizenEmail->save();
---
INSERT INTO `email` (`email`, `hash`) VALUES ('1111123@mail.ru', 'da5651237df3adcbe9b8efb9ff234468')